{"commit":{"author":{"login":"victor-homyakov","email":"homyakov@isida.by","name":"Victor Homyakov"},"authored_date":"2012-08-01T09:49:38-07:00","modified":[{"filename":"guides/getting_started_rinse_and_repeat.textile","diff":"@@ -252,7 +252,7 @@ The test we've written uses both CDI and EJB. That combination pushes the bounda\n \n In the previous guide, we used both embedded and managed containers. In both cases, Arquillian must start the container when the test suite begins and stop it when the tests are finished. What if you already have a container started (or you are willing to start one for the purpose of testing)? That's obviously going to be the fastest way to run the tests. Even if the container starts very fast, nothing beats no startup at all.\n \n-Remote containers provide an ideal development environment for integration testing. They also make debugging the test very straightforward, as you'll see later. Since there is no reference to the container in the test, using a remote container during development does not prevent you from using a managed container for continous integration. In fact, managed containers are best suited for continuous integration environments.\n+Remote containers provide an ideal development environment for integration testing. They also make debugging the test very straightforward, as you'll see later. Since there is no reference to the container in the test, using a remote container during development does not prevent you from using a managed container for continuous integration. In fact, managed containers are best suited for continuous integration environments.\n \n p(warning). %The term _remote_ refers to a separate process, not necessarily a separate machine, though it supports both scenarios.%\n \n@@ -369,7 +369,7 @@ h3. Run the Arquillian Test\n To run the Arquillian test, you need to perform three steps:\n \n # Start the remote container\n-# Activate the Maven profile that adds the cooresponding container adapter to the classpath\n+# Activate the Maven profile that adds the corresponding container adapter to the classpath\n # Run the test\n \n Let's start with JBoss AS.\n@@ -436,7 +436,7 @@ Of course, debugging the test in an embedded container is easy since it runs in\n \n h3. Debug the Arquillian Test\n \n-Debugging a test in a remote container? That seems hard. Surprise! It's not at all. You only have to modifiy one of the step above and add one additional step:\n+Debugging a test in a remote container? That seems hard. Surprise! It's not at all. You only have to modify one of the step above and add one additional step:\n \n # *Debug the remote container*\n # Activate the Maven profile that adds the corresponding container adapter to the classpath"}],"committed_date":"2012-08-01T09:49:38-07:00","parents":[{"id":"0a3329571061e980019a3a1824180998cf23a03f"}],"message":"Fixed typos","tree":"1f04e4a02b9f24cef6fa717f5339d351db003c2b","committer":{"login":"victor-homyakov","email":"homyakov@isida.by","name":"Victor Homyakov"},"url":"/arquillian/arquillian.github.com/commit/c159064529eecfcdf2e3f2e27d9a60c748cc8af6","id":"c159064529eecfcdf2e3f2e27d9a60c748cc8af6"}}